{
  "experience": "erfahrung",
  "skills": "Fähigkeiten",
  "projects": "Projekte",
  "project": "Projekt",
  "contact": "Kontakte",
  "developer": "Frontend Entwickler",
  "name": "Name",
  "message": "Nachricht",
  "email": "Email",
  "phone": "Telefonnummer",
  "subject": "Thema",
  "send": "Nachricht senden",
  "let_build": "Lasst uns gemeinsam etwas Legendäres aufbauen!",
  "w_build": "Was ich gebaut habe",
  "w_can_do": "Was ich tun kann",
  "w_experience": "Arbeitserfahrung",
  "more": "Mehr Info",
  "connect": "Lassen Sie uns verbinden",
  "Who I am": "Wer bin Ich",
  "iam": "Ich bin",
  "a": "",
  "code": "CODE",
  "back": "zurück",
  "overview": "Überblick",
  "technologies": "Die Technologien",
  "password_generator":"Ein einfacher, in Typescript geschriebener Passwortgenerator. Das Programm generiert eine zufällige Länge von alphanumerischen Zeichen.",
  "places_description": "Diese Anwendung stammt aus einem MERN-Udemy-Kurs. Wir haben den meistverkauften React-Kurs auf Udemy erstellt. Mit diesem Kurs können Sie jetzt Ihr React-Wissen auf die nächste Stufe bringen und Fullstack-Webanwendungen basierend auf React, NodeJS, MongoDB und Express erstellen! Der Aufbau von Fullstack-Anwendungen (also Frontend + Backend) mit dem MERN-Stack erfreut sich großer Beliebtheit – in diesem Kurs lernen Sie es von Grund auf am Beispiel eines kompletten Projekts! MERN steht für MongoDB, Express.js, React.js und Node.js – und zusammen ermöglichen Ihnen diese vier Technologien die Erstellung erstaunlicher Webanwendungen. In diesem Kurs bauen wir ein komplettes Projekt auf und Sie lernen Schritt für Schritt, wie diese verschiedenen Technologien zusammenarbeiten. Wir schauen uns zunächst alle einzelnen Bausteine ​​an, um sie am Ende des Kurses auch alle zu einer tollen Anwendung zu kombinieren. Dieser Kurs hört auch nicht mit den Grundlagen auf, sondern Sie lernen auch, wie Sie Datei-Upload, Authentifizierung und Autorisierung hinzufügen und wie Sie Ihre Anwendung auf unterschiedliche Weise für verschiedene Hosting-Dienste bereitstellen. Dieser Kurs wird von zwei Dozenten geleitet – Max (React.js, Node/Express) und Manuel (MongoDB), die über jahrelange Erfahrung in der Arbeit mit diesen Technologien und deren Vermittlung an andere Menschen verfügen. Wir haben unsere Erfahrungen genutzt und kombiniert, um Ihnen den bestmöglichen MERN-Stack-Kurs zu bieten, den Sie dort finden können.",
  "food_app_descrition": "Diese App wurde mit React JS erstellt",
  "rehacktor_description":"Mit dieser Anwendung können Benutzer nach einem Spiel suchen und das Streaming teilen, während sie mit ihren Freunden spielen.",
  "presto_description": "Eine Webanwendung, in der Benutzer Artikel veröffentlichen können, die sie verkaufen möchten, ähnlich wie Craig’s List. Benutzer suchen nach einer Plattform, die einfach zu bedienen ist, über mehrere Länder hinweg zugänglich ist und eine Inhaltsanalyse ermöglicht. Hauptimplementierungen: Mehrsprachigkeit, Bildgrößenänderung, Anwendung eines Wasserzeichens, Inhaltsanalyse, Gesichtsentfernung, Volltextsuche, Ankündigungsgenehmigungssystem.",
  "movie_app_description": "Diese Anwendung dient zum Streamen von Filmtrailern. Es wurde mit React implementiert.",
  "newsletter_description": "Newsletter-Anmeldeformular mit Erfolgsmeldung.",
  "motion_descrition": "Social-Media-Webanwendung, bei der sich Benutzer in der Web-App registrieren und anmelden können. Freunden folgen, ihnen entfolgen. Kommentiere, like und poste einen Beitrag.",
  "luna_app": "Luna Project – eine Restaurantbewertungsanwendung, mit der Benutzer lokale Restaurants finden, bewerten und kommentieren können.",
  "githubapp_description": "Diese Anwendung wird mit React JS erstellt. Sie können auf Github nach Benutzern suchen. Sobald Sie darauf klicken, werden Sie zu deren Profil weitergeleitet.",
  "description": "Von der brodelnden Welt der Küche in das dynamische Reich der Technik, nahm meine Reise während der Pandemie eine unerwartete Wendung. Die Kunst des Programmierens mit TypeScript, dem jüngeren Cousin von JavaScript, ist zu meiner Leidenschaft geworden. Mit einem tiefen Verständnis von Frontend-Technologien bringe ich eine einzigartige Mischung aus Kreativität und technischem Können in jedes Projekt ein. Derzeit erkunde ich neue Möglichkeiten in der Frontend-Landschaft - lassen Sie uns gemeinsam etwas Erstaunliches schaffen!",
  "whoiam_1": "Hallo! Ich bin Salvatore Dininni! Ich lebe derzeit in der Schweiz. Ich interessiere mich für Web-Technologien und Web-Entwicklung.",
  "whoiam_2": "Ich bin Frontend-Entwickler, hochmotiviert, offen für neue Herausforderungen, lernfähig, teamorientiert, kommunikationsstark und habe ein gutes Gespür für Design. Leidenschaft für Technologie und die Lösung technischer Herausforderungen. Offen für eine Stelle als Frontend.",
  "whoiam_3": "Meine Interessen liegen in der Lösung von Problemen im Zusammenhang mit Software-Webanwendungen und dem Entwerfen der coolsten Funktionen.",
  "whoiam_4": " Nach einer erfolgreichen Karriere als Chef de Cuisine ergriff ich die Gelegenheit, die sich mir bei Pandemic bot, um in die dynamische IT-Branche zu wechseln. Dieser Wechsel unterstreicht nicht nur meine Anpassungsfähigkeit, sondern spiegelt auch meinen Wunsch wider, mich neuen Herausforderungen zu stellen und mich in verschiedenen Bereichen auszuzeichnen.",
  "link_projects": "Schauen Sie sich meine neuesten Projekte an.",
  "get_in_touch": "In Kontakt kommen",
  "contanct_parag": "Ich bin freiberuflich oder als Vollzeitstelle verfügbar. Kontaktieren Sie mich und lassen Sie uns reden.",
  "ecommerce_description": "Meistern Sie MERN Stack Web Development und erstellen Sie die ultimative E-Commerce-App mit React Redux Ant Design Firebase NodeJs und MongoDB. Hauptfunktionen sind: Login-Registrierungssystem, Login mit E-Mail/Passwort und sozialem Login (Google), Admin-Dashboard und Bestellverwaltungssystem, Produkte CRUD mit erweiterten Funktionen wie Kategorien, Unterkategorien, mehrere Bild-Uploads usw., zahlreiche erweiterte Such- und Filteroptionen , Sternebewertungssystem, Warenkorbfunktionalität mit Backend-/Frontend-Implementierung, Checkout mit Stripe für Kreditkartenzahlungen, Checkout mit Nachnahme (keine Online-Zahlung erforderlich), Benutzer-Dashboard mit Passwortaktualisierung, Kaufhistorie, Rechnungs-/PDF-Download usw.",
  "eventapp_description": "Diese Anwendung wurde mit React JS und Express erstellt. Das Hauptziel besteht hier darin, eine Erinnerung für ein Ereignis zu einem späteren Zeitpunkt einzurichten.",
  "email_client": "In Angular implementierte Anwendung, in der sich der Benutzer registrieren kann. Nach der Authentifizierung kann der Benutzer die laufenden E-Mails in seinem eigenen Postfach anzeigen, neue E-Mails senden und auf die im Postfach befindlichen antworten.",
  "whack-bug": "Entwicklung eines Spiels namens \"Whack a Bug\" mit HTML, CSS und JavaScript.",
  "about-me": "Über mich"
}