{
  "experience": "experience",
  "skills": "Skills",
  "projects": "projects",
  "project": "Project",
  "contact": "contact",
  "developer": "Web Developer",
  "name": "name",
  "message": "message",
  "email": "email",
  "phone": "phone number",
  "subject": "subject",
  "send": "send message",
  "let_build": "Let's build something legendary together!",
  "w_build": "What I have Built",
  "w_can_do": "What I Can Do",
  "w_experience": "Work experience",
  "more": "more info",
  "connect": "Let's connect",
  "Who I am": "Who I am",
  "iam": "I'm",
  "a": "a",
  "code": "CODE",
  "back": "back",
  "overview": "Overview",
  "technologies": "Technologies",
  "password_generator":"A simple password generator written in Typescript. The program generates a random length of alphanumeric characters.",
  "places_description": "This Application is from an MERN Udemy course, We built the bestselling React course on Udemy - this course now allows you to take your React knowledge to the next level and build fullstack web apps based on React, NodeJS, MongoDB and Express! Building fullstack applications (i.e. frontend + backend) with the MERN stack is very popular - in this course, you will learn it from scratch at the example of a complete project! MERN stands for MongoDB, Express.js, React.js and Node.js - and combined, these four technologies allow you to build amazing web applications. In this course, we'll build an entire project and you will learn how these different technologies work together step by step. We'll first have a look at all the individual building blocks, so that we then can also combine them all into one amazing application by the end of the course. This course also doesn't stop after the basics - instead, you'll also learn how to add file upload, authentication, authorization and how to deploy your application in different ways to different hosting services. This course is taught by two instructors - Max (React.js, Node/ Express) and Manuel (MongoDB) who have years of experience of working with these technologies and teaching them to other people. We took and combined our experiences to deliver you the best possible MERN stack course you can find out there.",
  "food_app_descrition": "This app was build using React JS",
  "rehacktor_description":"This application allows users to search for a game, and share the streaming while they are playing with their friends.",
  "presto_description": "A web application where users can post items that they wanted to sell, similar to Craig’s List. Users are looking for a platform that is easy to use, accessible across multiple countries, and allows for content analysis. Main implementations: Multi Language, Image Resizing, Application of a watermark, Content Analysis, Face removal, Search Full Text, Announcement Approval System.",
  "movie_app_description": "This application is for streaming movie trailers. It was implemented using React.",
  "newsletter_description": "Newsletter sign-up form with success message.",
  "motion_descrition": "Social Media web application, where users can register and login in the web app. Follow, unfollow friends. Comment, like and post a post.",
  "luna_app": "Luna Project – a restaurant review application where users can find, rate, and comment on local restaurants.",
  "githubapp_description": "This application is created using React JS, you can search for users on github, once you click on it, you will be redirected to their profile.",
  "description": "From the sizzling world of the kitchen to the dynamic realm of tech, my journey took an unexpected turn during the pandemic. Embracing the art of coding with TypeScript, React, and Angular has become my passion. With a deep understanding of frontend technologies, I bring a unique blend of creativity and technical prowess to every project. Currently exploring new opportunities in the frontend landscape – let's create something amazing together!",
  "whoiam_1": "Hello! I’m Salvatore Dininni! I currently live in Southern California. I'm passionate about Web Technologies and Web Development.",
  "whoiam_2": "I'm a Web Developer, highly motivated, open to new challenges, quick learner, team-oriented, with good communication skills, and with a good eye for design. Passionate about technology and solving technical challenges. Open for a position as Frontend.",
  "whoiam_3": "My interests lie in solving problems related software Web Applications, and designing the coolest features.",
   "whoiam_4": "Transitioning from a successful career as a Chef de Cuisine, I seized the opportunity presented by the pandemic to pivot into the dynamic realm of IT. This shift not only underscores my adaptability but also reflects my eagerness to embrace new challenges and excel in diverse domains.",
  "link_projects": "Check out my latest projects.",
  "get_in_touch": "Get In Touch",
  "contanct_parag": "I am available for freelance or a full-time positions. Contact me and let's talk.",
  "ecommerce_description": "Master MERN Stack Web Development building Ultimate E-commerce app with React Redux Ant Design Firebase NodeJs and MongoDB. Main Features are: Login Registration System, Login with email/password and social login (Google) Admin dashboard and order management system, Products CRUD with advance features including categories, sub-categories, multiple image uploads etc, Plenty of advance searching and filtering options, Star rating system, Cart functionality with both backend/frontend implementation, Checkout with stripe for credit card payments, Checkout with cash on delivery (no online payment required), User dashboard with password update, purchase history, Invoice/PDF download etc.",
  "eventapp_description": "This application was build using React JS and Express, the main goal here is to set a reminder for an event, later in time.",
  "email_client": "Application implemented in Angular in which the user can register. Following authentication, the user can view incoming e-mails in their inbox, write new e-mails and reply to those in their inbox.",
  "whack-bug": "Developed a game called Whack a Bug using HTML, CSS and JavaScript",
  "about-me": "About Me",
  "services": "Services",
  "prov_services": "Provided Services",
  "hosting-description" : "I am proud to offer an all-inclusive web hosting service that empowers businesses and individuals to establish a robust online presence effortlessly. With our comprehensive suite of features, I cater to every aspect of your online journey, from domain creation to email management and beyond.",
  "service-app-creation":"Creation of websites and web applications",
  "restyling-description": "You already have a website and want to make it attractive to attract new customers. I am at your disposal.",
  "app-creation-description": "I am an expert in creating modern applications and websites. Additionally, I am well-versed in modern technologies such as React, Angular, and Laravel. For further information, please do not hesitate to contact me.",
  "select_service": "Select a type of service",
  "restyling_dev": "Restyling",
  "web_dev": "App or Web Development",
  "hosting": "Hosting"
}