{
  "experience": "Esperienze",
  "skills": "Skills",
  "projects": "Progetti",
  "project": "Progetto",
  "contact": "Contatti",
  "developer": "Sviluppatore Frontend",
  "name": "nome",
  "message": "messaggio",
  "email": "mail",
  "subject": "soggetto",
  "phone": "numero di telefono",
  "send": "inviare",
  "let_build": "Creiamo insieme qualcosa di leggendario!",
  "w_build": "Cosa ho realizzato",
  "w_can_do": "Cosa posso fare",
  "w_experience": "Esperienze Lavorative",
  "more": "Ulteriori info",
  "code": "CODICE",
  "back": "indietro",
  "overview":"Panoramica",
  "technologies": "Tecnologie",
  "ecommerce_description": "MERN Stack Web Development è un'applicazione E-commerce avanzata che utilizza React Redux Ant Design Firebase NodeJs e MongoDB. Le caratteristiche principali sono: Sistema di registrazione del login, login con email/password e social login (Google) Dashboard di amministrazione e sistema di gestione degli ordini, CRUD dei prodotti con funzionalità avanzate, tra cui categorie, sottocategorie, caricamento di immagini multiple, ecc. Numerose opzioni di ricerca e filtraggio. Sistema di valutazione a stelle. Funzionalità carrello con implementazione sia backend che frontend. Checkout con stripe per i pagamenti con carta di credito. Cassa con pagamento in contrassegno (non è richiesto il pagamento online). Dashboard utente con aggiornamento della password, cronologia degli acquisti, download di fatture/PDF ecc.",
  "connect": "Connettiamoci",
  "Who I am": "Chi sono",
  "iam": "Io sono",
  "a": "uno",
  "password_generator":"Un semplice generatore di password scritto in Typescript. Esegue la generazione di una lunghezza casuale di caratteri alfanumerici.",
  "places_description": "Questa applicazione proviene da un corso MERN Udemy. Abbiamo creato il corso React più venduto su Udemy: questo corso ora ti consente di portare le tue conoscenze su React a un livello superiore e creare app Web complete basate su React, NodeJS, MongoDB ed Express! Costruire applicazioni fullstack (cioè frontend + backend) con lo stack MERN è molto popolare: in questo corso lo imparerai da zero utilizzando l'esempio di un progetto completo! MERN sta per MongoDB, Express.js, React.js e Node.js e, combinate, queste quattro tecnologie ti consentono di creare straordinarie applicazioni web. In questo corso costruiremo un intero progetto e imparerai passo dopo passo come queste diverse tecnologie lavorano insieme. Daremo prima uno sguardo a tutti i singoli elementi costitutivi, in modo da poterli poi combinare tutti in un'unica straordinaria applicazione entro la fine del corso. Inoltre, questo corso non si ferma alle nozioni di base: imparerai invece anche come aggiungere il caricamento di file, l'autenticazione, l'autorizzazione e come distribuire la tua applicazione in modi diversi su diversi servizi di hosting. Questo corso è tenuto da due istruttori: Max (React.js, Node/Express) e Manuel (MongoDB) che hanno anni di esperienza di lavoro con queste tecnologie e di insegnamento ad altre persone. Abbiamo preso e combinato le nostre esperienze per offrirti il ​​miglior corso possibile sullo stack MERN che puoi trovare là fuori.",
  "food_app_descrition": "Questa applicazione è stata creata usando la libreria ReactJS",
  "rehacktor_description":"Questa applicazione consente agli utenti di cercare un gioco e condividere lo streaming mentre giocano con i propri amici.",
  "presto_description": "Un'applicazione web in cui gli utenti possono pubblicare gli articoli che desiderano vendere, simile a Craig's List. Gli utenti cercano una piattaforma facile da usare, accessibile in più paesi e che consenta l'analisi dei contenuti. Principali implementazioni: Multi Lingua, Ridimensionamento immagini, Applicazione watermark, Analisi contenuti, Rimozione volti, Ricerca Full Text, Sistema Approvazione Annunci.",
  "movie_app_description":"Questa applicazione è per lo streaming di trailer di film. È stato implementata utilizzando React.", 
  "newsletter_description": "Modulo di iscrizione alla newsletter con messaggio di successo.",
  "motion_descrition": " Applicazione Web di social media, in cui gli utenti possono registrarsi e accedere all'app Web. Follow/unfollow i tuoi amici. Commenta, metti mi piace e pubblica un post.",
  "luna_app": "Luna Project: un'applicazione per recensioni di ristoranti in cui gli utenti possono trovare, valutare e commentare i ristoranti locali.",
  "githubapp_description": "Questa applicazione è stata creata utilizzando React JS, puoi cercare utenti su github, una volta fatto clic su di esso, verrai reindirizzato al loro profilo.",
  "description": "Dal frizzante mondo della cucina al dinamico regno della tecnologia, il mio viaggio ha preso una piega inaspettata durante la pandemia. Abbracciare l'arte della programmazione con TypeScript, React e Angular è diventata la mia passione. Con una profonda conoscenza delle tecnologie frontend, apporto a ogni progetto una miscela unica di creatività e abilità tecnica. Attualmente sto esplorando nuove opportunità nel panorama dei frontend: creiamo insieme qualcosa di straordinario!",
  "whoiam_1": "Ciao a tutti! Sono Salvatore Dininni! Attualmente vivo nel Sud della California. Sono appassionato di tecnologie web e sviluppo web.",
  "whoiam_2": "Sono uno sviluppatore Frontend, altamente motivato, aperto a nuove sfide, che impara velocemente, orientato al team, con buone capacità di comunicazione e con un buon occhio per il design. Appassionato di tecnologia e di risolvere sfide tecniche. Aperto per una posizione come Frontend.",
  "whoiam_3": "I miei interessi si concentrano sulla risoluzione di problemi legati alle applicazioni web e sulla progettazione delle più belle funzionalità.",
  "whoiam_4": " Transizione da una carriera di successo come Chef de Cuisine, ho colto l'opportunità offerta dalla pandemia per fare il passaggio nel dinamico settore dell'IT. Questo cambiamento non solo sottolinea la mia adattabilità, ma riflette anche il mio desiderio di abbracciare nuove sfide ed eccellere in diversi settori.",
  "link_projects": "Scopri i miei ultimi progetti.",
  "get_in_touch": "Contattami",
  "contanct_parag": "Sono disponibile per posizioni da freelance o a tempo pieno. Contattatemi e parliamone.",
  "eventapp_description": "Questa applicazione è stata creata utilizzando React JS ed Express, l'obiettivo principale qui è impostare un promemoria per un evento, ed inviare una email in un secondo momento.",
  "email_client": "Applicazione implementata in Angular in cui l'utente può registrarsi. Dopo l'autenticazione, l'utente può visualizzare le e-mail in arrivo nella propria casella di posta, scrivere nuove e-mail e rispondere a quelle nella casella di posta.",
  "whack-bug": "Sviluppo di un gioco chiamato \"Whack a Bug\" con HTML, CSS e JavaScript.",
  "about-me": "Chi sono",
  "services": "Servizi",
  "prov_services": "Lista dei Services",
  "hosting-description" : "Sono orgogliosi di offrire un servizio di hosting web completo che permette a imprese e privati di stabilire una solida presenza online in modo semplice. Con la mia gamma completa di funzionalità, mi occupo di ogni aspetto del tuo percorso online, dalla creazione del dominio alla gestione delle email e oltre.",
  "service-app-creation":"Creazione di Siti ed Applicationi Web",
  "restyling-description": "Avete già un sito web e volete renderlo accattivante per attirare nuovi clienti. Sono a vostra disposizione.",
  "app-creation-description": "Sono esperto nella creazione di applicazioni e siti web moderni. Inoltre, possiedo una conoscenza approfondita di tecnologie moderne come React, Angular e Laravel. Per ulteriori informazioni non esitate a contattarmi.",
  "select_service": "Selezionare un tipo di servizio",
  "restyling_dev": "Restyling",
  "web_dev": "Sviluppo di applicativi Web",
  "hosting": "Hosting"
}  
